{
  "personal": {
    "name": "Новицкий Владислав",
    "post": "Фронтенд-разработчик",
    "photoURL": "photo.webp"
  },
  "experience": [
    {
      "mostRecent": true,
      "startDate": "06.2024",
      "endDate": "12.2024",
      "post": "Фронтенд-разработчик",
      "organization": "ПАО \"Сбербанк России\"",
      "postDescription": "Стек: TypeScript, React, Redux, Jest, ESLint, Jira, Confluence. Разработка и поддержка React-приложения-оболочки для микрофронтендов, внесение улучшений в рабочие инструменты проекта",
      "responsibilities": [
        "Разработал 7 компонентов на React, включая компоненты для отображения информации о модулях, пользователях, правах доступа и истории изменений из Jira, обеспечив единый интерфейс для внутренних сервисов",
        "Реализовал модули генерации HTML-документации для Confluence, автоматизировав выпуск документации и снизив ручные трудозатраты на 80%",
        "Разработал библиотеку-обёртку над fetch с типизацией и интеграцией в Redux, сделав подключение новых API типобезопасным и улучшив читаемость бизнес-логики",
        "Провёл рефакторинг модулей библиотеки, устранив дублирование и упростив сопровождение",
        "Оптимизировал структуру проекта в Git, устранив ошибки сохранения, связанные с длинными путями, и обеспечив стабильную работу репозитория",
        "Дополнил конфигурацию ESLint-правилами для и добавил автоматическую проверку при пуше, что позволило предотвращать ошибки на этапе CI и повысило единообразие кода",
        "Увеличил покрытие тестами с 40% до 60%, написав unit-тесты для ключевых компонентов и снизив вероятность регрессий"
      ]
    },
    {
      "organization": "Частные разработки для строительного контроля",
      "startDate": "2021",
      "endDate": "2023",
      "mostRecent": false,
      "post": "Фронтенд-разработчик",
      "postDescription": "Стек: TypeScript, JavaScript, React, Redux. Разработка внутренних инструментов для автоматизации рутинных процессов и повышения точности при строительном контроле",
      "responsibilities": [
        "Разработал веб-приложение для учёта выданных предписаний и формирования отчётов, что позволило автоматизировать регулярную отчётность и сократить ручной труд",
        "Модифицировал и адаптировал собственные инструменты под новые задачи при смене проектов, расширив функциональность и улучшив UX",
        "Создал приложение на JavaScript и Google Spreadsheets для анализа объёмов работ и генерации замечаний, что помогло снизить риск ошибок при проверке исполнительной документации"
      ]
    }
  ],
  "about": {
    "text": [
      "Разрабатываю веб-приложения с упором на качество кода, удобство поддержки и переиспользуемость решений. В работе предпочитаю строго типизированный подход с использованием TypeScript, активно применяю generics, utility и условные типы.",
      "Использую Git в повседневной работе, включая продвинутые приёмы: интерактивный rebase, pre-commit хуки с Husky, настройку CI/CD пайплайнов для автоматизации тестирования и деплоя (GitHub Actions, GitLab CI).",
      "Настраиваю и поддерживаю линтеры и форматтеры, включая ESLint и Stylelint, с интеграцией в пайплайны. Уделяю внимание единому стилю и читаемости кода в команде.",
      "Пишу unit- и интеграционные тесты с использованием Jest, React Testing Library и Playwright. Стремлюсь к высокому покрытию кода и надёжности приложений.",
      "Постоянно развиваюсь как разработчик. Сейчас изучаю Vue.js (включая Vue Router и Pinia), Nest.js и PostgreSQL для расширения технического кругозора и бэкенд-компетенций."
    ]
  },
  "skills": [
    {
      "title": "Основной стек",
      "list": [
        "TypeScript",
        "HTML/CSS",
        "React",
        "Redux"
      ]
    },
    {
      "title": "Тестирование и QA",
      "list": [
        "Jest",
        "React Testing Library",
        "Playwright"
      ]
    },
    {
      "title": "Фреймворки и технологии",
      "list": [
        "Next.js"
      ]
    },
    {
      "title": "Инструменты и DevOps",
      "list": [
        "Git",
        "Webpack",
        "NPM",
        "Husky",
        "ESLint/Prettier",
        "Figma",
        "GitHub/GitLab/BitBucket"
      ]
    },
    {
      "title": "Дополнительно",
      "list": [
        "Nest.js",
        "Firebase",
        "Postgre SQL",
        "Bash"
      ]
    }
  ],
  "languages": [
    {
      "name": "English",
      "grade": "B2 Upper Intermediate",
      "mark": 8
    }
  ],
  "contacts": {
    "phone": "+79038117314",
    "email": "vladislav@nvtsk.ru",
    "github": "v-nvtsk",
    "telegram": "no_vlad",
    "city": "Москва"
  },
  "education": {
    "higherEducation": [
      {
        "institution": "Карагандинский Государственный Технический Университет",
        "specialization": "Строительство, бакалавр",
        "city": "Караганда",
        "endDate": "2009"
      }
    ],
    "courses": [
      {
        "institution": "Отус-онлайн образование",
        "specialization": "Специализация Javascript-фулстек разработчик",
        "startDate": "2023",
        "endDate": "2025"
      },
      {
        "institution": "Школа 21-образовательный проект от Сбер для разработчиков",
        "specialization": "Основное обучение",
        "startDate": "2024",
        "endDate": "н.в"
      }
    ]
  },
  "projects": [
    {
      "title": "Моё резюме",
      "stack": [
        "react",
        "typescript",
        "jspdf"
      ],
      "link": "https://github.com/v-nvtsk/v-nvtsk.github.io",
      "description": "Проект на React, отображающий моё резюме. Поддерживает функцию печати и сохранения в PDF с добавлением QR-кодов при сохранении или печати. Это резюме было сохранено в PDF с использованием данного приложения"
    },
    {
      "title": "Site time-tracker",
      "stack": [
        "typescript",
        "react",
        "Mui X",
        "redux/toolkit",
        "nestjs",
        "postgre sql",
        "chrome extension"
      ],
      "link": "https://github.com/v-nvtsk/time-tracker",
      "description": "Приложение для отслеживания своего времени, проведённого на сайтах, состоящее из Chrome-расширения для сбора данных, бэкенда на NestJS для обработки и хранения информации, и веб-интерфейса на React для визуализации статистики"
    },
    {
      "title": "Календарь событий",
      "stack": [
        "react",
        "typescript",
        "redux/toolkit",
        "react-router",
        "firebase",
        "jest",
        "react-testing-library",
        "playwright"
      ],
      "link": "https://github.com/v-nvtsk/calendar",
      "description": "Проект для учёта событий, задач. Поддерживает авторизацию пользователей по email и паролю."
    },
    {
      "title": "Учет расходов",
      "stack": [
        "react",
        "typescript",
        "redux/toolkit",
        "react-router",
        "firebase",
        "jest",
        "react-testing-library"
      ],
      "link": "https://github.com/v-nvtsk/expenses-app",
      "description": "Проект для учёта расходов. Позволяет добавлять расходы и отображать статистику с разбивкой по категориям."
    },
    {
      "title": "Life game",
      "stack": [
        "html",
        "css",
        "canvas",
        "typescript",
        "jest"
      ],
      "link": "https://github.com/v-nvtsk/life-game",
      "description": "Игра, в которой человек создаёт начальное состояние, а потом лишь наблюдает за её развитием."
    },
    {
      "title": "Клиентский роутер",
      "stack": [
        "typescript",
        "jest"
      ],
      "link": "https://github.com/v-nvtsk/npm-package-routelib",
      "description": "Проект библиотеки для управления навигацией на стороне клиента. Поддерживает хэш и history-API роутинг."
    },
    {
      "title": "Github-pages deploy",
      "stack": [
        "typescript",
        "jest"
      ],
      "link": "https://github.com/v-nvtsk/nvtsk-deploy-gh",
      "description": "NPM пакет для публикации сборки в github-pages. Предоставляет интерактивный выбор параметров, либо через аргументы CLI."
    }
  ]
}