{
  "personal": {
    "name": "Новицкий Владислав",
    "post": "Fullstack-разработчик/фулстек-разработчик",
    "photoURL": "photo.webp"
  },
  "experience": [
    {
      "mostRecent": true,
      "startDate": "06.2024",
      "endDate": "12.2024",
      "post": "Фронтенд-разработчик",
      "organization": "ПАО \"Сбербанк России\"",
      "postDescription": "Разработка и поддержка централизованного React-приложения, оптимизация процессов разработки",
      "responsibilities": [
        "Разработал 7 React-компонентов для отображения информации о модулях, пользователях, правах доступа и истории изменений из Jira",
        "Добавил правила в ESLint для обеспечения единообразия кода и предотвращения ошибок после пуша в репозиторий",
        "Решил проблему с длинными путями файлов в Git, изменив внутреннее дерево папок и обеспечив сохранение файлов в репозитории",
        "Разработал библиотеку для замены стандартного fetch с использованием сложной логики и типизации, интегрировав её с Redux для управления состоянием запросов и их результатами",
        "Дополнил отдельными модулями библиотеку для формирования HTML-контента для автоматизации выпуска документации в Confluence",
        "Увеличил покрытие тестами с 40% до 60%, написав юнит-тесты для ключевых компонентов проекта"
      ]
    },
    {
      "organization": "Программные решения для строительства",
      "startDate": "2021",
      "endDate": "2023",
      "mostRecent": false,
      "post": "",
      "postDescription": "Разработка цифровых решений для упрощения работы и минимизации ошибок при выполнении строительного контроля",
      "responsibilities": [
        "Самостоятельно разработал приложение для автоматизации учёта выданных предписаний и формирования еженедельных отчётов на основе этих данных, работая в свободное от основной работы время",
        "Использовал и адаптировал ранее разработанные приложения для новых требований при смене места работы, улучшив их функциональность и удобство использования",
        "Разработал приложение на JavaScript для анализа представленных объёмов работ и выдачи замечаний, что позволило снизить вероятность ошибок в документации и математических вычислениях при приёмке выполненных объемов работ",
        "С 2021 года занимаюсь разработкой приложений для автоматизации процессов. Общий опыт работы в строительном контроле — 15 лет.",
        "Проводил проверки в соответствии с нормативно-технической документацией",
        "Составлял регламенты, планы и отчёты",
        "Контролировал соблюдение проектной документации"
      ]
    }
  ],
  "about": {
    "text": [
      "По первой специальности я инженер, специализирующийся на автоматике и управлении. Учебный процесс включал множество дисциплин, связанных с программированием и автоматизацией, что заложило прочную базу для дальнейшего развития в IT.",
      "Уверенно работаю с Git, включая продвинутые функции: интерактивный rebase для оптимизации истории коммитов, настройка pre-commit хуков через Husky и автоматизация процессов проверки кода. Настраиваю CI/CD пайплайны на GitHub Actions и GitLab CI для автоматического тестирования, сборки и деплоя проектов.",
      "Пишу код на TypeScript, применяя сложные типы: условные (conditional types), mapped types, рекурсивные и utility types. Избегаю использования any, предпочитая строгую типизацию, что минимизирует ошибки и улучшает читаемость кода. Разрабатываю библиотеки с продуманной типизацией и высокой степенью переиспользуемости.",
      "Настраиваю линтеры (ESLint, Stylelint) и форматтеры (Prettier) для обеспечения единого стиля кода в командах. Интегрирую их в процессы CI/CD для автоматической проверки.",
      "Тестирую приложения с использованием Jest, React Testing Library и Playwright. Пишу юнит- и интеграционные тесты, покрывая сложные сценарии и повышая надёжность приложений.",
      "Постоянно изучаю новые технологии. В данный момент углубляюсь в изучение Vue.js (включая Vue Router и Pinia), а также Nest.js и PostgreSQL."
    ]
  },
  "skills": [
    {
      "title": "Основной стек",
      "list": [
        "TypeScript",
        "JavaScript",
        "HTML/CSS",
        "React",
        "Redux"
      ]
    },
    {
      "title": "Тестирование и QA",
      "list": [
        "Jest",
        "React Testing Library",
        "Playwright",
        "Postman"
      ]
    },
    {
      "title": "Фреймворки и технологии",
      "list": [
        "Next.js",
        "Firebase",
        "Nest.js",
        "Postgre SQL"
      ]
    },
    {
      "title": "Инструменты и DevOps",
      "list": [
        "Git",
        "Webpack",
        "NPM",
        "Husky",
        "ESLint/Prettier",
        "Figma",
        "GitHub/GitLab/BitBucket"
      ]
    },
    {
      "title": "Дополнительные языки",
      "list": [
        "VB/VBA",
        "Bash",
        "Си",
        "MASM32"
      ]
    }
  ],
  "languages": [
    {
      "name": "English",
      "grade": "B2 Upper Intermediate",
      "mark": 8
    }
  ],
  "contacts": {
    "phone": "+79038117314",
    "email": "vladislav@nvtsk.ru",
    "github": "v-nvtsk",
    "telegram": "no_vlad",
    "city": "Москва"
  },
  "education": {
    "higherEducation": [
      {
        "institution": "Карагандинский Государственный Технический Университет",
        "specialization": "Строительство, бакалавр",
        "city": "Караганда",
        "endDate": "2009"
      },
      {
        "institution": "Карагандинский Государственный Технический Университет",
        "specialization": "Гидравлические машины, гидроприводы и гидро-пневмо-автоматика, инженер",
        "city": "Караганда",
        "endDate": "2006"
      }
    ],
    "courses": [
      {
        "institution": "Отус-онлайн образование",
        "specialization": "Специализация Javascript-фулстек разработчик",
        "startDate": "2023",
        "endDate": "2025"
      },
      {
        "institution": "Школа 21-образовательный проект от Сбер для разработчиков",
        "specialization": "Основное обучение",
        "startDate": "2024",
        "endDate": "2024 - н.в"
      }
    ]
  },
  "projects": [
    {
      "title": "Календарь событий",
      "stack": [
        "react",
        "typescript",
        "redux/toolkit",
        "react-router",
        "firebase",
        "jest",
        "react-testing-library",
        "playwright"
      ],
      "link": "https://github.com/v-nvtsk/calendar",
      "description": "Проект для учёта событий, задач. Поддерживает авторизацию пользователей по email и паролю."
    },
    {
      "title": "Учет расходов",
      "stack": [
        "react",
        "typescript",
        "redux/toolkit",
        "react-router",
        "firebase",
        "jest",
        "react-testing-library"
      ],
      "link": "https://github.com/v-nvtsk/expenses-app",
      "description": "Проект для учёта расходов. Позволяет добавлять расходы и отображать статистику с разбивкой по категориям."
    },
    {
      "title": "Life game",
      "stack": [
        "html",
        "css",
        "canvas",
        "typescript",
        "jest"
      ],
      "link": "https://github.com/v-nvtsk/life-game",
      "description": "Игра, в которой человек создаёт начальное состояние, а потом лишь наблюдает за её развитием."
    },
    {
      "title": "Клиентский роутер",
      "stack": [
        "typescript",
        "jest"
      ],
      "link": "https://github.com/v-nvtsk/npm-package-routelib",
      "description": "Проект библиотеки для управления навигацией на стороне клиента. Поддерживает хэш и history-API роутинг."
    },
    {
      "title": "Github-pages deploy",
      "stack": [
        "typescript",
        "jest"
      ],
      "link": "https://github.com/v-nvtsk/nvtsk-deploy-gh",
      "description": "NPM пакет для публикации сборки в github-pages. Предоставляет интерактивный выбор параметров, либо через аргументы CLI."
    }
  ]
}